; domain
(define (domain healthcare_facility_2_numeric)
    (:requirements :strips :typing :numeric-fluents :conditional-effects)

    (:types
        location carrier - object
        worker_bot helper_bot - robot
        med_unit robot box supply patient - locatable
    )

    (:predicates
        ; location related
        (at ?obj - locatable ?loc - location) ; locatable is at a location
        (linked ?loc1 - location ?loc2 - location) ; two locations are linked (roadmap)
        
        ; General Robot related
        (bot_is_free ?bot - robot) ; bot is free (not carrying a box or helping a patient)
        
        ; Worker bots
        (bot_owns_carrier ?bot - robot ?carr - carrier) ; a bot owns a carrier
        
        ; Helper bots
        (helping_patient ?bot - helper_bot ?pat - patient) ; helper bot is helping the patient

        ; Carrier related
        (carrying_box ?carr - carrier ?obj - box) ; carrier has the box loaded
        
        ; Box related
        (box_is_empty ?box - box) ; box is empty
        (box_on_ground ?box - box) ; box is on the ground (not being carried by a bot)

        ; Patient related
        (patient_on_ground ?pat - patient) ; patient is on the ground (not being helped)

        ; Supply related
        (supply_in_box ?sup - supply ?box - box) ; supply is in a box
        
        ; Goal Oriented
        (needs_supply ?mu - med_unit ?sup - supply) ; medical unit needs a supply
        (needs_patient ?mu - med_unit ?pat - patient) ; medical unit needs a patient so he they can treat them
        (has_supply ?mu - med_unit ?sup - supply) ; medical unit has a supply
        (has_patient ?mu - med_unit ?pat - patient) ; medical unit has a patient
    )

    (:functions
        (carrier_max_capacity ?carr - carrier) - number
        (carrier_cur_capacity ?carr - carrier) - number
    )

    ;;
    ;; Move Actions
    ;;
    
    (:action move_bot_alone
        :parameters (?bot - robot ?from - location ?to - location)
        :precondition (and
            ; location consistency
            (at ?bot ?from)
            (linked ?from ?to)
            ; the bot is free (carrier is empty or helping a patient)
            (bot_is_free ?bot)
        )
        :effect (and
            ; change location (bot)
            (not (at ?bot ?from))
            (at ?bot ?to)
        )
    )
    
    (:action move_worker_bot_with_boxes
        :parameters (?bot - worker_bot ?carr - carrier ?from - location ?to - location)
        :precondition (and
            ; location consistency
            (at ?bot ?from)
            (linked ?from ?to)
            ; the bot is busy carrying the box
            (bot_owns_carrier ?bot ?carr)
            (> (carrier_cur_capacity ?carr) 0)
        )
        :effect (and
            ; change location (bot)
            (not (at ?bot ?from))
            (at ?bot ?to)
            ; change location (boxex)
            (forall (?box - box)
                (when (carrying_box ?carr ?box)
                    (and
                        (not (at ?box ?from))
                        (at ?box ?to)
                    )
                )
            )
        )
    )

    (:action move_helper_bot_patient
        :parameters (?bot - helper_bot ?from - location ?to - location ?pat - patient)
        :precondition (and
            ; location consistency
            (at ?bot ?from)
            (linked ?from ?to)
            ; helper bot is helping a patient
            (helping_patient ?bot ?pat)
        )
        :effect (and
            ; update location (bot)
            (not (at ?bot ?from))
            (at ?bot ?to)
            ; update location (patient)
            (not (at ?pat ?from))
            (at ?pat ?to)
        )
    )
    

    ;;
    ;; Worker Bots : These are the bots that carry boxes with supplies  
    ;;

    (:action pick_up_box
        :parameters (?bot - worker_bot ?carr - carrier ?box - box ?loc - location)
        :precondition (and
            ; location consistency
            (at ?bot ?loc)
            (at ?box ?loc)
            ; the box is not being carried
            (box_on_ground ?box)
            ; carrier has space
            (bot_owns_carrier ?bot ?carr)
            (< (carrier_cur_capacity ?carr) (carrier_max_capacity ?carr))
        )
        :effect (and
            ; robot now has the box
            (not (box_on_ground ?box))
            (carrying_box ?carr ?box)
            ; bot is busy
            (when (= (carrier_cur_capacity ?carr) 0) ; Was empty before pickup
                (not (bot_is_free ?bot))
            )
            ; increase the current capacity of the carrier
            (increase (carrier_cur_capacity ?carr) 1)
        )
    )

    (:action drop_down_box
        :parameters (?bot - worker_bot ?carr - carrier ?box - box)
        :precondition (and
            ; bot owns the carrier
            (bot_owns_carrier ?bot ?carr)
            ; the bot carries the box
            (carrying_box ?carr ?box)

        )
        :effect (and
            ; leave box there
            (not (carrying_box ?carr ?box))
            (box_on_ground ?box)
            ; bot becomes free if capacuty was 1, as now it will become 0
            (when (= (carrier_cur_capacity ?carr) 1) 
                (bot_is_free ?bot)
            )
            ; decrease the current capacity of the carrier
            (decrease (carrier_cur_capacity ?carr) 1)
        )
    )

    (:action fill_box
        :parameters (?bot - worker_bot ?box - box ?sup - supply ?loc - location)
        :precondition (and
            ; location consistency
            (at ?bot ?loc)
            (at ?sup ?loc)
            (at ?box ?loc)
            ; the box is not being carried
            (box_on_ground ?box)
            ; box must be empty
            (box_is_empty ?box)
        )
        :effect (and
            ; fill the box with the supply
            (supply_in_box ?sup ?box)
            (not (box_is_empty ?box))
        )
    )


    (:action deliver_supply
        :parameters (?bot - worker_bot ?box - box ?sup - supply ?loc - location ?mu - med_unit)
        :precondition (and
            ; location consistency
            (at ?bot ?loc)
            (at ?mu ?loc)
            (at ?box ?loc)
            ; the box is NOT being carried
            (box_on_ground ?box)
            ; the supply is in the box
            (supply_in_box ?sup ?box)
            ; the medical unit needs such supply
            (needs_supply ?mu ?sup)
        )
        :effect (and
            ; empty the box
            (not (supply_in_box ?sup ?box))
            (box_is_empty ?box)
            ; satisfy the medical unit's need and hand over the supply
            (not (needs_supply ?mu ?sup)) 
            (has_supply ?mu ?sup)
        )
    )

    ;;
    ;; Helper Bots : These are the bots that accompany patients to medical units
    ;;

    (:action pick_up_patient
        :parameters (?bot - helper_bot ?pat - patient ?loc - location)
        :precondition (and
            ; location consistency
            (at ?bot ?loc)
            (at ?pat ?loc)
            ; patient is not being helped by some other bot
            (patient_on_ground ?pat)
            ; helper bot is not busy
            (bot_is_free ?bot)
        )
        :effect (and
            ; helper bot accompanies the patient
            (helping_patient ?bot ?pat)
            (not (patient_on_ground ?pat))
            ; helper bot is now busy
            (not (bot_is_free ?bot))
        )
    )
    (:action drop_down_patient
        :parameters (?bot - helper_bot ?pat - patient)
        :precondition (and
            ; helper bot accompanies the patient
            (helping_patient ?bot ?pat)
        )
        :effect (and
            ; helper bot no longer accompanies the patient
            (not (helping_patient ?bot ?pat))
            (patient_on_ground ?pat)
            ; helper bot is no longer busy
            (bot_is_free ?bot)
        )
    )
    (:action deliver_patient
        :parameters (?bot - helper_bot ?pat - patient ?mu - med_unit ?loc - location)
        :precondition (and
            ; location consistency
            (at ?bot ?loc)
            (at ?mu ?loc)
            (at ?pat ?loc)
            ; the patient is not being helped by some other bot
            (patient_on_ground ?pat) 
            ; the patient needs treatment at the medical unit
            (needs_patient ?mu ?pat)
        )
        :effect (and
            ; satisfy the medical unit's need for the patient and hand over the patient
            (not (needs_patient ?mu ?pat))
            (has_patient ?mu ?pat)
        )
    )
)

; problem
(define (problem healthcare_facility_2_numeric)
    (:domain healthcare_facility_2_numeric)

    (:objects 
        ;; Locations
        entrance reception diagnostic_lab corridor1 corridor2 central_warehouse
        surgical_block emergency_room cardiology_ward neurology_ward
        - location

        ;; Robots
        wBot1 - worker_bot
        hBot1 - helper_bot

        ;; Carrier (new in this domain)
        carrier1 - carrier

        ;; Boxes
        box1 box2 - box

        ;; Supplies
        scalpel defibrillator - supply

        ;; Medical Units
        trauma_unit resuscitation_unit triage_unit operation_unit cardiology_unit neurology_unit - med_unit

        ;; Patients
        patient1 - patient
    )

    (:init
        ;; Roadmap
        (linked entrance reception)
        (linked reception entrance)

        (linked reception emergency_room)
        (linked emergency_room reception)

        (linked emergency_room corridor2)
        (linked corridor2 emergency_room)

        (linked corridor2 diagnostic_lab)
        (linked diagnostic_lab corridor2)

        (linked corridor1 diagnostic_lab)
        (linked diagnostic_lab corridor1)
        
        (linked surgical_block corridor1)
        (linked corridor1 surgical_block)

        (linked corridor1 central_warehouse)
        (linked central_warehouse corridor1)

        (linked reception corridor1)
        (linked corridor1 reception)

        (linked diagnostic_lab neurology_ward)
        (linked neurology_ward diagnostic_lab)

        (linked surgical_block cardiology_ward)
        (linked cardiology_ward surgical_block)

        ;; Carrier setup (using numeric fluents from domain)
        (bot_owns_carrier wBot1 carrier1)
        (= (carrier_max_capacity carrier1) 3)  ; Carrier can hold 3 boxes
        (= (carrier_cur_capacity carrier1) 0)  ; Carrier starts empty

        ;; Medical unit locations
        (at trauma_unit emergency_room)
        (at resuscitation_unit emergency_room)
        (at triage_unit reception)
        (at operation_unit surgical_block)
        (at cardiology_unit cardiology_ward)
        (at neurology_unit neurology_ward)

        ;; Robots are free at their initial positions
        (at wBot1 central_warehouse)
        (at hBot1 entrance)
        
        ;; Bots are free
        (bot_is_free wBot1)
        (bot_is_free hBot1)

        ;; Boxes at central_warehouse
        (at box1 central_warehouse)
        (at box2 central_warehouse)
        
        ;; Boxes are empty
        (box_is_empty box1)
        (box_is_empty box2)

        ;; Boxes on the ground
        (box_on_ground box1)
        (box_on_ground box2)

        ;; Supplies at central_warehouse
        (at scalpel central_warehouse)
        (at defibrillator central_warehouse)

        ;; Patient at entrance, not being helped
        (at patient1 entrance) 
        (patient_on_ground patient1)

        ;; Medical unit needs
        (needs_supply trauma_unit scalpel)
        (needs_supply resuscitation_unit defibrillator)
        (needs_patient operation_unit patient1)
    )

    (:goal
        (and
            ;; Satisfy all supply needs
            (has_supply trauma_unit scalpel)
            (has_supply resuscitation_unit defibrillator)
            
            ;; Satisfy patient need
            (has_patient operation_unit patient1)

            ;; Bots return to starting positions
            (at wBot1 central_warehouse)
            (at hBot1 entrance)
            (bot_is_free wBot1)
            (bot_is_free hBot1)

            ;; Carrier is empty (using numeric fluent)
            (= (carrier_cur_capacity carrier1) 0)

            ;; Return boxes (empty) to the central warehouse
            (at box1 central_warehouse)
            (at box2 central_warehouse)
            (box_is_empty box1)
            (box_is_empty box2)
            (box_on_ground box1)
            (box_on_ground box2)
        )
    )
)

; plan
1. (fill_box wbot1 box1 defibrillator central_warehouse)
   deleted: (box_is_empty box1)
   added: (supply_in_box defibrillator box1)
   goals met: 10 of 14
2. (pick_up_box wbot1 carrier1 box1 central_warehouse)
   deleted: (box_on_ground box1) (bot_is_free wbot1)
   added: (carrying_box carrier1 box1)
   changed: (carrier_cur_capacity carrier1) from 0 to 1
   goals met: 7 of 14
3. (fill_box wbot1 box2 scalpel central_warehouse)
   deleted: (box_is_empty box2)
   added: (supply_in_box scalpel box2)
   goals met: 6 of 14
4. (pick_up_box wbot1 carrier1 box2 central_warehouse)
   deleted: (box_on_ground box2)
   added: (carrying_box carrier1 box2)
   changed: (carrier_cur_capacity carrier1) from 1 to 2
   goals met: 5 of 14
5. (move_worker_bot_with_boxes wbot1 carrier1 central_warehouse corridor1)
   deleted: (at wbot1 central_warehouse) (at box1 central_warehouse) (at box2 central_warehouse)
   added: (at wbot1 corridor1) (at box1 corridor1) (at box2 corridor1)
   goals met: 2 of 14
6. (move_worker_bot_with_boxes wbot1 carrier1 corridor1 reception)
   deleted: (at wbot1 corridor1) (at box1 corridor1) (at box2 corridor1)
   added: (at wbot1 reception) (at box1 reception) (at box2 reception)
   goals met: 2 of 14
7. (move_worker_bot_with_boxes wbot1 carrier1 reception emergency_room)
   deleted: (at wbot1 reception) (at box1 reception) (at box2 reception)
   added: (at wbot1 emergency_room) (at box1 emergency_room) (at box2 emergency_room)
   goals met: 2 of 14
8. (drop_down_box wbot1 carrier1 box2)
   deleted: (carrying_box carrier1 box2)
   added: (box_on_ground box2)
   changed: (carrier_cur_capacity carrier1) from 2 to 1
   goals met: 3 of 14
9. (drop_down_box wbot1 carrier1 box1)
   deleted: (carrying_box carrier1 box1)
   added: (box_on_ground box1) (bot_is_free wbot1)
   changed: (carrier_cur_capacity carrier1) from 1 to 0
   goals met: 6 of 14
10. (deliver_supply wbot1 box1 defibrillator emergency_room resuscitation_unit)
   deleted: (supply_in_box defibrillator box1) (needs_supply resuscitation_unit defibrillator)
   added: (box_is_empty box1) (has_supply resuscitation_unit defibrillator)
   goals met: 8 of 14
11. (deliver_supply wbot1 box2 scalpel emergency_room trauma_unit)
   deleted: (supply_in_box scalpel box2) (needs_supply trauma_unit scalpel)
   added: (box_is_empty box2) (has_supply trauma_unit scalpel)
   goals met: 10 of 14
12. (pick_up_box wbot1 carrier1 box1 emergency_room)
   deleted: (box_on_ground box1) (bot_is_free wbot1)
   added: (carrying_box carrier1 box1)
   changed: (carrier_cur_capacity carrier1) from 0 to 1
   goals met: 7 of 14
13. (pick_up_box wbot1 carrier1 box2 emergency_room)
   deleted: (box_on_ground box2)
   added: (carrying_box carrier1 box2)
   changed: (carrier_cur_capacity carrier1) from 1 to 2
   goals met: 6 of 14
14. (move_worker_bot_with_boxes wbot1 carrier1 emergency_room reception)
   deleted: (at wbot1 emergency_room) (at box1 emergency_room) (at box2 emergency_room)
   added: (at wbot1 reception) (at box1 reception) (at box2 reception)
   goals met: 6 of 14
15. (move_worker_bot_with_boxes wbot1 carrier1 reception corridor1)
   deleted: (at wbot1 reception) (at box1 reception) (at box2 reception)
   added: (at wbot1 corridor1) (at box1 corridor1) (at box2 corridor1)
   goals met: 6 of 14
16. (move_worker_bot_with_boxes wbot1 carrier1 corridor1 central_warehouse)
   deleted: (at wbot1 corridor1) (at box1 corridor1) (at box2 corridor1)
   added: (at wbot1 central_warehouse) (at box1 central_warehouse) (at box2 central_warehouse)
   goals met: 9 of 14
17. (drop_down_box wbot1 carrier1 box2)
   deleted: (carrying_box carrier1 box2)
   added: (box_on_ground box2)
   changed: (carrier_cur_capacity carrier1) from 2 to 1
   goals met: 10 of 14
18. (drop_down_box wbot1 carrier1 box1)
   deleted: (carrying_box carrier1 box1)
   added: (box_on_ground box1) (bot_is_free wbot1)
   changed: (carrier_cur_capacity carrier1) from 1 to 0
   goals met: 13 of 14
19. (pick_up_patient hbot1 patient1 entrance)
   deleted: (patient_on_ground patient1) (bot_is_free hbot1)
   added: (helping_patient hbot1 patient1)
   goals met: 12 of 14
20. (move_helper_bot_patient hbot1 entrance reception patient1)
   deleted: (at hbot1 entrance) (at patient1 entrance)
   added: (at hbot1 reception) (at patient1 reception)
   goals met: 11 of 14
21. (move_helper_bot_patient hbot1 reception corridor1 patient1)
   deleted: (at hbot1 reception) (at patient1 reception)
   added: (at hbot1 corridor1) (at patient1 corridor1)
   goals met: 11 of 14
22. (move_helper_bot_patient hbot1 corridor1 surgical_block patient1)
   deleted: (at hbot1 corridor1) (at patient1 corridor1)
   added: (at hbot1 surgical_block) (at patient1 surgical_block)
   goals met: 11 of 14
23. (drop_down_patient hbot1 patient1)
   deleted: (helping_patient hbot1 patient1)
   added: (patient_on_ground patient1) (bot_is_free hbot1)
   goals met: 12 of 14
24. (deliver_patient hbot1 patient1 operation_unit surgical_block)
   deleted: (needs_patient operation_unit patient1)
   added: (has_patient operation_unit patient1)
   goals met: 13 of 14
25. (move_bot_alone hbot1 surgical_block corridor1)
   deleted: (at hbot1 surgical_block)
   added: (at hbot1 corridor1)
   goals met: 13 of 14
26. (move_bot_alone hbot1 corridor1 reception)
   deleted: (at hbot1 corridor1)
   added: (at hbot1 reception)
   goals met: 13 of 14
27. (move_bot_alone hbot1 reception entrance)
   deleted: (at hbot1 reception)
   added: (at hbot1 entrance)
   goals met: 14 of 14
